        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Lab5.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT PeopleLab5 ASSIGN TO "PeopleLab3.dat"
        ORGANIZATION IS LINE SEQUENTIAL
        ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PeopleLab5.
01 PPeopleAttributes.
        02 PNAME PIC X(20).
        02 PDEGREE.
           03 PDEGREETYPE PIC X(4).
           03 PDEGREEYEAR PIC X(4).
        02 PLOAN.
           03 PAMOUNT PIC 9(5)V99.
           03 PPAID1 PIC 9(4)V99.
           03 PPAID2 PIC 9(4)V99.
           03 PPAID3 PIC 9(4)V99.
           03 PPAID4 PIC 9(4)V99.
           03 PTOTALPAID PIC 9(5)V99.
           03 PBALANCE PIC 9(5)V99.

WORKING-STORAGE SECTION.
01 SPACING PIC X(2) VALUE SPACES.
01 SPACING2 PIC X(20) VALUE SPACES.
01 SPeopleA.
        02 SPNAME PIC X(20).
        02 SDEGREE.
           03 SDEGREETYPE PIC X(4).
           03 SDEGREEYEAR PIC X(4).
        02 SLOAN.
           03 SAMOUNT PIC 9(5)V99.
           03 SPAID1 PIC 9(4)V99.
           03 SPAID2 PIC 9(4)V99.
           03 SPAID3 PIC 9(4)V99.
           03 SPAID4 PIC 9(4)V99.
           03 STOTALPAID PIC 9(5)V99.
           03 SBALANCE PIC 9(5)V99.
        02 SFILLER PIC X(52).
01 FileEnd PIC A(1).
01 SPAIDTABLE.
      05 SPAID PIC 9(4)V99 OCCURS 4 TIMES.
      

PROCEDURE DIVISION.
DISPLAY "Name"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
SPACES SPACES SPACES SPACES"Degree"SPACES SPACES"Year" SPACING "Loan"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES"Paid"
DISPLAY SPACING

DISPLAY SPACES.

OPEN INPUT PeopleLab5.
        
        PERFORM UNTIL FileEnd='Y'
           READ PeopleLab5 INTO SPeopleA
                AT END MOVE 'Y' TO FileEnd
                
                NOT AT END DISPLAY SPNAME SDEGREETYPE SPACES SPACES SPACES SPACES SDEGREEYEAR SPACES SPACES SAMOUNT 
                SPACES SPACES SPACES SPACES SPAID1
                MOVE SPAID1 TO SPAID(1)
                MOVE SPAID2 TO SPAID(2)
                MOVE SPAID3 TO SPAID(3)
                MOVE SPAID4 TO SPAID(4)
                DISPLAY SPACES SPACES SPACES SPACES SPACING2 SPACES SPACES SPACES SPAID(2)
                DISPLAY SPACES SPACES SPACES SPACES SPACING2 SPACES SPACES SPACES SPAID(3)
                DISPLAY SPACES SPACES SPACES SPACES SPACING2 SPACES SPACES SPACES SPAID(4)
                COMPUTE STOTALPAID = SPAID1 + SPAID2 + SPAID3 + SPAID4
                DISPLAY SPACING2 "TOTAL PAID" SPACES STOTALPAID WITH NO ADVANCING
                COMPUTE SBALANCE = SAMOUNT - STOTALPAID
                DISPLAY SPACES SPACES SPACES SPACES SPACES "BALANCE" SPACES SBALANCE 
                DISPLAY SPACES  
                DISPLAY SPACES

           END-READ
        END-PERFORM

CLOSE PeopleLab5.

STOP RUN.
